In [9]:
import pandas as pd

In [11]:
#create data frames with the pandas list
data = [["deepika" , 99] ,["priyansh"  , 99]]

In [13]:
data

[['deepika', 99], ['priyansh', 99]]

In [15]:
pd.DataFrame(data)

          0   1
0   deepika  99
1  priyansh  99

In [17]:
pd.DataFrame(data , columns =["name", "marks"])

       name  marks
0   deepika     99
1  priyansh     99

In [23]:
data =  {"a":[4,5,6] ,"b":[33,44,55]}

In [25]:
data

{'a': [4, 5, 6], 'b': [33, 44, 55]}

In [34]:
dic  = { "a" :"deepika", "b":"priyansh"}

In [36]:
dic

{'a': 'deepika', 'b': 'priyansh'}